app/views/shelters/show.html.erb

<p>
  <% @shelter.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 1]]