app/controllers/pets/favorites_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "favorite_status" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["favorite_status", "t"], ["updated_at", "2020-07-09 15:01:27.540604"], ["id", 1]]
---
  def update
    @pet = Pet.find(params[:id])
    new_status = @pet.favorite_status ? false : true
    @pet.update(favorite_status: new_status)