app/controllers/applications_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "pet_applications" ("pet_id", "application_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pet_id", 1], ["application_id", 1], ["created_at", "2020-07-12 01:05:11.854843"], ["updated_at", "2020-07-12 01:05:11.854843"]]
---
  def create
    pets = Pet.where(id: applications_params[:pet_ids])
    Pet.transaction do
      pets.each do |pet|
        application = Application.new(
          applications_params.except(:pet_ids)
        )
        pet.applications << application