app/controllers/pets_controller.rb

  def pet_list
    @shelter_identifier = Shelter.find(params[:id])
    @shelter_pets = @shelter_identifier.pets
    @count = @shelter_pets.count
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 1]]

  def new
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 127], ["LIMIT", 1]]

  def create
    unfilled_params = pet_params.select{|param, value| value.empty?}
    shelter = Shelter.find(params[:shelter_id])
    if !unfilled_params.empty?
      flash[:notice] = "Please fill in #{unfilled_params.keys.join(", ")} to create a pet"
      redirect_back(fallback_location: "/shelters/#{shelter.id}/pets/new")
    else
      shelter.pets.create(pet_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 127], ["LIMIT", 1]]
INSERT INTO "pets" ("name", "image", "approximate_age", "sex", "created_at", "updated_at", "shelter_id", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    pet = Pet.find(params[:id])
    pet.update(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 98], ["LIMIT", 1]]
UPDATE "pets" SET "name" = $1, "image" = $2, "description" = $3, "approximate_age" = $4, "sex" = $5, "updated_at" = $6 WHERE "pets"."id" = $7  [["name", "Winnie the Poo"], ["image", ""], ["description", ""], ["approximate_age", nil], ["sex", "Male"], ["updated_at", "2020-07-07 01:44:39.892223"], ["id", 98]]

  def destroy
    pet = Pet.find(params[:id])
    if pet.adoption_status == true
      favorite.remove_pet(pet.id)
      Pet.destroy(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 88]]