app/controllers/reviews_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "image", "created_at", "updated_at", "shelter_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    shelter = Shelter.find(params[:id])
    new_review = Review.create(review_params)