app/controllers/shelters_controller.rb

  def index
    @shelters = Shelter.all
---
SELECT "shelters".* FROM "shelters"

  def show
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    Shelter.create(shelter_params)
---
INSERT INTO "shelters" ("name", "address", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 151], ["LIMIT", 1]]

  def update
    shelter = Shelter.find(params[:id])
    shelter.update(shelter_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 151], ["LIMIT", 1]]
UPDATE "shelters" SET "name" = $1, "address" = $2, "zip" = $3, "updated_at" = $4 WHERE "shelters"."id" = $5  [["name", "LoHi Animal Shelter"], ["address", "3501 Pecos Street"], ["zip", 80206], ["updated_at", "2020-07-07 01:44:40.071072"], ["id", 151]]

  def destroy
    shelter = Shelter.find(params[:id])
    arr = []
    shelter.pets.each do |pet|
      list = PetApplication.where("pet_id = ?", pet.id).where("status = ?", true)
      unless list.empty?
        arr << list
      end
    end
    if arr.empty?
      Shelter.destroy(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 148], ["LIMIT", 1]]
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 148]]